"""
数据库生成、写入常量
"""

# 1.数据库名
formRecord, formResult, formCurve, formUI, form61850 = \
    'Record', 'ResultCal', 'Curve', 'UI', 'To61850'
# 2.模块名
modules = ['气体', '局放', '机械特性', '储能', '振动', '避雷器', '隔离开关触头', '环境']
# 3.位置名 + 传感器套数
gasLoc = [['断路器A相气室', 1], ['断路器B相气室', 1], ['断路器C相气室', 1],
          ['Ⅰ母母线气室', 1], ['Ⅱ母母线气室', 1],
          ['母线侧隔离开关QSF1气室', 1], ['母线侧隔离开关QSF2气室', 1],
          ['出线侧隔离开关QS3气室', 1], ['出线侧隔离开关QS4气室', 1]]
pdLoc = [['断路器A相', 1], ['断路器B相', 1], ['断路器C相', 1],
         ['Ⅰ母母线', 1], ['Ⅱ母母线', 1]]
mcLoc = [['母线侧隔离开关QSF1', 1], ['母线侧隔离开关QSF2', 1],
         ['出线侧隔离开关QS3', 1], ['出线侧隔离开关QS4', 1],
         ['断路器', 1]]
esLoc = [['断路器A相', 1], ['断路器B相', 1], ['断路器C相', 1]]
vbLoc = [['Ⅰ母母线', 3], ['Ⅱ母母线', 3],
         ['断路器A相', 3], ['断路器B相', 3], ['断路器C相', 3]]
laLoc = [['避雷器A相', 1], ['避雷器B相', 1], ['避雷器C相', 1]]
touchLoc = [['母线侧隔离开关QSF1触头状态', 3], ['母线侧隔离开关QSF2触头状态', 3],
            ['出线侧隔离开关QS3触头状态', 3]]
evLoc = [['柜内温湿度', 1], ['环境温湿度', 1], ['断路器机构箱温湿度', 1],
         ['隔离开关机构箱1', 1], ['隔离开关机构箱2', 1], ['隔离开关机构箱3', 1], ['快速接地', 1]]
# 4.记录数据 { '数据名': [单位,正误,实时,值(a,b,c)]}
gasData = {
    '相对压力': ['MPa', 1, 0],
    '温度': ['℃', 1, 0],
    '密度': ['MPa', 1, 0],
    '微水': ['ppm', 1, 0]
}
pdData = {
    '局部放电幅值': ['dBm', 1, 0],
    '局部放电功率': ['mW', 1, 0],
    '局部放电频次': ['次/s', 1, 0],
    '脉冲个数': ['个', 1, 0],
}
msData = {
    '分闸时间': ['ms', 1, 0, 0, 0],
    '合闸时间': ['ms', 1, 0, 0, 0],
    '电流持续时间': ['ms', 1, 0, 0, 0],
    '最大工作电流': ['A', 1, 0, 0, 0],
    '平均工作电流': ['A', 1, 0, 0, 0]
}
mbData = {
    '操作类型': ['', 1, 0, 0, 0],
    # '机械操作次数': ['次', 0, 1, 0, 0, 0],
    '一分行程量': ['mm', 1, 0, 0, 0],
    '一分时间': ['ms', 1, 0, 0, 0],
    '一分速度': ['m/s', 1, 0, 0, 0],
    '一分电流': ['A', 1, 0, 0, 0],
    '一分带电时间': ['ms', 1, 0, 0, 0],
    '一分同期': ['ms', 1, 0, 0, 0],
    '合行程量': ['mm', 1, 0, 0, 0],
    '合时间': ['ms', 1, 0, 0, 0],
    '合速度': ['m/s', 1, 0, 0, 0],
    '合电流': ['A', 1, 0, 0, 0],
    '合带电时间': ['ms', 1, 0, 0, 0],
    '合同期': ['ms', 1, 0, 0, 0],
    '二分行程量': ['mm', 1, 0, 0, 0],
    '二分时间': ['ms', 1, 0, 0, 0],
    '二分速度': ['m/s', 1, 0, 0, 0],
    '二分电流': ['A', 1, 0, 0, 0],
    '二分带电时间': ['ms', 1, 0, 0, 0],
    '二分同期': ['ms', 1, 0, 0, 0]
}
esData = {
    '储能电机电流': ['A', 1, 0],
    '启动电流': ['A', 1, 0],
    '启动时间': ['ms', 1, 0],
    '储能状态': ['', 1, 0],
    '储能时间': ['ms', 1, 0],
    '储能次数': ['次', 1, 0],
    '分弹簧压力': ['kN', 1, 0],
    '合弹簧压力': ['kN', 1, 0],
    '分弹簧压力最大值': ['kN', 1, 0],
    '合弹簧压力最大值': ['kN', 1, 0]
}
vbData = {
    '加速度': ['g', 1, 0, 0, 0],
    '频率': ['Hz', 1, 0, 0, 0],
}
laData = {
    '全电流': ['mA', 1, 0],
    '阻性电流': ['mA', 1, 0],
    '阻容比': ['', 1, 0],
    '最近落雷时间': ['s', 1, 0],
    '最近落雷次数': ['', 1, 0],
    '参考相角': ['°', 1, 0],
    '传感器电池电压': ['V', 1, 0],
    '传感器电池充放电电流': ['A', 1, 0]
}
touchData = {
    '位置': ['', 1, 0, 0, 0],
    '温度': ['℃', 1, 0, 0, 0]
}
evData = {
    '温度': ['℃', 1, 0],
    '湿度': ['%', 1, 0]
}
# 5.对应关系(61850初始化)
modLocData = {
    modules[0]: [gasLoc, gasData],
    modules[1]: [pdLoc, pdData],
    modules[2]: [mcLoc, msData, mbData],
    modules[3]: [esLoc, esData],
    modules[4]: [vbLoc, vbData],
    modules[5]: [laLoc, laData],
    modules[6]: [touchLoc, touchData],
    modules[7]: [evLoc, evData]
}
